In [2]:
import pandas as pd
#create a dictionary
data={"A":["a1",'a2','a3','a4'],
      "B":['b1','b2','b3','b4'],
      "C":['c1','c2','c3','c4'],
      "d":['d1','d2','d3','d4']
      }
#covert dic into dataframe
d=pd.DataFrame(data)
print(d)

    A   B   C   d
0  a1  b1  c1  d1
1  a2  b2  c2  d2
2  a3  b3  c3  d3
3  a4  b4  c4  d4

In [10]:
#remove a single column using drop()
d.drop(['A'],axis=1)

    B   C   d
0  b1  c1  d1
1  b2  c2  d2
2  b3  c3  d3
3  b4  c4  d4

In [12]:
#remove multiple columns
d.drop(['C','d'],axis=1)

    A   B
0  a1  b1
1  a2  b2
2  a3  b3
3  a4  b4

In [23]:
import pandas as pd
#create a dictionary
h={"A":["a1",'a2','a3','a4'],
      "B":['b1','b2','b3','b4'],
      "C":['c1','c2','c3','c4'],
      "d":['d1','d2','d3','d4']
      }
#covert dic into dataframe
o=pd.DataFrame(h)
o.drop(o.columns[[1,2,1]],axis=1,inplace=True)
print(o)

    A   d
0  a1  d1
1  a2  d2
2  a3  d3
3  a4  d4

In [28]:
o.replace("A","B")
o

    A   d
0  a1  d1
1  a2  d2
2  a3  d3
3  a4  d4

In [32]:
import pandas as pd
#create a dictionary
p={"A":["a1",'a2','a3','a4'],
      "B":['b1','b2','b3','b4'],
      "C":['c1','c2','c3','c4'],
      "d":['d1','d2','d3','d4']
      }
#covert dic into dataframe
q=pd.DataFrame(p)
q.replace("A","o")

    A   B   C   d
0  a1  b1  c1  d1
1  a2  b2  c2  d2
2  a3  b3  c3  d3
3  a4  b4  c4  d4